import { CategoryType, FaqType, NewsType } from "@/types"


export const news: NewsType[] = [
    {
        title: "Новий Рекорд Адопції",
        description: "Цей березень став особливим для нашої платформи - 50 безпритульних тварин...",
        imageUrl: './dog-news.jpg',
        authorName: "Ігор",
        authorImageUrl: "./igor.png",
        publishedAt: "5 квітня 2025 року",
    },
    {
        title: "Волонтерський Марафон",
        description: "Ми запускаємо волонтерський марафон \"Лапа Допомоги\". Щоб підтримати притулки, які пе...",
        imageUrl: './maraphon-news.jpg',
        authorName: "Ілля",
        authorImageUrl: "./illiajpg.jpg",
        publishedAt: "10 квітня 2025 року",
    },
    {
        title: "Історія Успіху: Кошеня Міра Знайшло Дім",
        description: "Маленьке кошення Міра, знайдене на вулиці, тепер гріється в люблячій родині! Завдяки ог...",
        imageUrl: './cat-news.jpg',
        authorName: "Марія",
        authorImageUrl: "./mariya.png",
        publishedAt: "8 квітня 2025 року",
    },
]

export const categories: CategoryType[] = [
    { label: 'Все', value: 'all' },
    { label: 'Волонтери', value: 'volunteers' },
    { label: 'Притулки', value: 'shelters' },
  ];

export const faq: FaqType[] = [
    {
        question: "Що робить наша платформа?",
        answer: "Наша платформа — це універсальний ресурс, створений для порятунку безпритульних тварин. Вона об’єднує тих, хто хоче допомогти: ви можете передати знайдену тварину до притулку або знайти нового улюбленця для себе.",
    },
    {
        question: "Як я можу допомогти безпритульним тваринам через ваш сайт?",
        answer: "Ви можете розмістити оголошення про знайдену тварину, зв’язатися з притулками для її передачі або переглянути анкети тварин, які шукають дім. Також ми вітаємо волонтерську підтримку та поширення інформації.",
    },
    {
        question: "Чи потрібно реєструватися, щоб скористатися платформою?",
        answer: "Реєстрація необов’язкова для перегляду оголошень, але вона потрібна, щоб розміщувати інформацію про тварин або подавати заявку на адопцію. Це допомагає нам забезпечити безпеку та відповідальність.",
    },
    {
        question: "Як передати знайдену тварину до притулку через ваш сайт?",
        answer: "Заповніть форму на сайті, вказавши деталі про тварину (додавання фото, опису тварини, віку, здоров'я та інших характеристик). Ми зв’яжемо вас із найближчим притулком, який готовий прийняти тварину.",
    },
    {
        question: "Як я можу взяти тварину з притулку?",
        answer: "Перегляньте анкети тварин на нашій платформі, оберіть улюбленця та зв’яжіться з притулком через вказані контакти. Після співбесіди та перевірки ви зможете забрати тварину додому.",
    },
    {
        question: "Чи перевіряються притулки, з якими ви співпрацюєте?",
        answer: "Так, ми співпрацюємо лише з перевіреними притулками, які відповідають стандартам догляду за тваринами. Ми регулярно оновлюємо інформацію, щоб гарантувати їхню надійність.",
    },
    {
        question: "Які тварини представлені на платформі?",
        answer: "На сайті є інформація про різні види тварин — собак, котів, птахів, гризунів та інших, які потребують дому.",
    },
    {
        question: "Чи можна розмістити оголошення про зниклу тварину?",
        answer: "Так, ви можете створити оголошення про зниклу тварину, додавши її фото, опис та контакти. Це допоможе швидше знайти вашого улюбленця.",
    },
    {
        question: "Як я можу підтримати платформу, якщо не можу взяти тварину?",
        answer: "Ви можете стати волонтером, поширювати наші оголошення в соціальних мережах або зробити благодійний внесок на підтримку притулків через наш сайт.",
    },
    {
        question: "Чи є якісь витрати для користувачів платформи?",
        answer: "Використання платформи безкоштовне. Однак  Однак деякі притулки можуть мати власні вимоги, наприклад, покриття витрат на вакцинацію чи стерилізацію тварини перед адопцією.",
    }
]